;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! elcord)
(package! all-the-icons)
(package! multiple-cursors)

(package! puppet-mode)
(package! jenkinsfile-mode)
(package! js2-mode)
(package! company-jedi)

(package! flycheck-clang-tidy)
(package! xref :pin "a82f459b37b31546bf274388baf8aca79e9c30d9")

;; (package! xterm-mouse :disable t)
